/*
	Напишіть коротку програму,
	яка оголошує клас з однією звичайною змінною-членом та однією статичною змінною-членом.
	Створіть конструктор, який виконує ініціалізацію змінної-члена та збільшення статичної змінної-члена.
	Потім оголосіть деструктор, який зменшує на одиницю значення статичної змінної.
*/

#include <string>

using str = std::string;//це даю псевдонім моєму типу данних string   

class MyRabbit
{
public:
	static int InHole;
	
	MyRabbit(str name) :name_(name) { ++InHole; }
	~MyRabbit() { --InHole; }

private:
	str name_;
};


int MyRabbit::InHole = 0;